wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/dmic_reg.h
	__I  uint32_t DSP0ROMMBISTL;         /*!< [0x0054] DMIC DSP0 ROM MBIST Signature LSB                                 */
	__I  uint32_t DSP0ROMMBISTH;         /*!< [0x0058] DMIC DSP0 ROM MBIST Signature MSB                                */
    __I  uint32_t RESERVE4[1];
//    __I  uint32_t DSP1ROMDATA;           /*!< [0x0060] DMIC DSP1 ROM Test Data Register                                 */
    __IO  uint32_t DSP1ROMDATA;//for test           /*!< [0x0060] DMIC DSP1 ROM Test Data Register                                 */
	__I  uint32_t DSP1ROMMBISTL;         /*!< [0x0064] DMIC DSP1 ROM MBIST Signature LSB                                 */
	__I  uint32_t DSP1ROMMBISTH;         /*!< [0x0068] DMIC DSP1 ROM MBIST Signature MSB                                */


} DMIC_T;


typedef struct
{


/**
 * @var VAD_T::SINCCTL
 * Offset: 0x00  VAD SINC Filter Control Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[11:8]  |SINCOSR   |VAD SINC Filter OSR Setting
 * |        |          |000 = Down sample 48
 * |        |          |001 = Down sample 64
 * |        |          |010 = Down sample 96
 * |        |          |Others = Reserved. Do not use.
 * |[15:12] |SINCGAIN  |VAD SINC Filter Gain Control
 * |        |          |Gain Adjustment to the SINC filter.
 * |[28]    |DATAOFF   |VAD Sending Data to SRAM Control
 * |        |          |When the ACTIVE (VAD_STATUS0[31]) goes high, the data will be transferred to SRAM to store which can be used for keyword detection later
 * |        |          |After some time, if user needs to stop sending data to SRAM, write this bit to 1.
 * |[29]    |SW        |VAD Path Switch Control
 * |        |          |After the ACTIVE(VAD_STATUS0[31]) goes high, it will automatically switch to the DMIC path
 * |        |          |When the CPU is entering idle mode, write 1 to switch back to the VAD path.
 * |        |          |Note 1: After switch back VAD path, user need to set this bit to 0.
 * |        |          |Note 2: User need to set DMIC_CTL[3:0] to 1 and clear ACTIVE (VAD_STATUS0[31]) before set this bit 1.
 * |[30]    |ACTCL     |VAD Active Flag Clear
 * |        |          |0 = No effect.
 * |        |          |1 = Clear ACTIVE(VAD_STATUS0[31]).
 * |        |          |Note: After ACTIVE(VAD_STATUS0[31]) is cleared, user need to set set this bit to 0.
 * |[31]    |VADEN     |VAD Enable Control
 * |        |          |0 = VAD Disabled.
 * |        |          |1 = VAD Enabled.
 * |        |          |Note 1: When set this bit to 1, CHEN0 (DMIC_CTL[0]) will be set to 1 and CHEN1 (DMIC_CTL[1]), CHEN2 (DMIC_CTL[2]) and CHEN3 (DMIC_CTL[3]) will be set to 0 automatically.
 * |        |          |Note 2: When set this bit to 1, DMIC_CLK is generated by VAD module.
 * @var VAD_T::BIQCTL0
 * Offset: 0x04  VAD Biquad Filter Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |BIQA1     |VAD Biquad Filter Coefficient
 * |        |          |Biquad Filter Coefficient a1, in 3 intergers + 13 fractional bits
 * |[31:16] |BIQA2     |VAD Biquad Filter Coefficient
 * |        |          |Biquad Filter Coefficient a2, in 3 intergers + 13 fractional bits.
 * @var VAD_T::BIQCTL1
 * Offset: 0x08  VAD Biquad Filter Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |BIQB0     |VAD Biquad Filter Coefficient
 * |        |          |Biquad Filter Coefficient b0, in 3 intergers + 13 fractional bits.
 * |[31:16] |BIQB1     |VAD Biquad Filter Coefficient
 * |        |          |Biquad Filter Coefficient b1, in 3 intergers + 13 fractional bits.
 * @var VAD_T::BIQCTL2
 * Offset: 0x0C  VAD Biquad Filter Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |BIQB2     |VAD Biquad Filter Coefficient
 * |        |          |Biquad Filter Coefficient b2, in 3 intergers + 13 fractional bits.
 * |[31]    |BIQEN     |VAD Biquad Filter Enable Bit
 * |        |          |0 = VAD Biquad Filter Disabled.
 * |        |          |1 = VAD Biquad Filter Enabled.
 * @var VAD_T::CTL0
 * Offset: 0x10  VAD Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[7:0]   |STAT      |Short Term Power Attack Time
 * |        |          |Slow attack (e.g., 0x99): slow responding to voice, but more stable.
 * |        |          |Fast attack (e.g., 0xCC): fast responding to voice, but more sensitive to other sounds.
 * |        |          |Suggested default attack time setting: Long term power attack time (0x5), Short term power attack time (0xAA).
 * |        |          |The u201CShort Term Poweru201D, in order to detect the instant power of the voices, requires faster attack time, while u201CLong Term Poweru201D, in order to get the averaged power of the background environment, requires slower attack time to maintain its stability
 * |        |          |So the Short term power attack time should be always bigger than the Long term power attack time.
 * |[11:8]  |STAAT     |Short Term Average Power Attack Time Setting, Not used here, set it 0
 * |[14:12] |STPS      |Selection setting in Short Term Average Power calculation, Not used here, set it 0
 * |[19:16] |LTAT      |Long Term Power Attack Time
 * |        |          |Slow attack (e.g., 0x5): less sensitive to environment change.
 * |        |          |Fast attack (e.g., 0x8): more sensitive to environment change.
 * |[20]    |TESTMODE  |Set this to be 1, can data out the BIQ, SINC data through the DMIC FIFO
 * @var VAD_T::CTL1
 * Offset: 0x14  VAD Control Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |STTHREHWM |Short Term Power Threshold Upper Limit
 * |        |          |To check if the incoming signal is big enough to be ready for VAD activation.
 * |[31:16] |STTHRELWM |Short Term Power Threshold Lower Limit
 * |        |          |To check if the incoming signal is small enough so that VAD status can be terminated.
 * @var VAD_T::CTL2
 * Offset: 0x18  VAD Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |STATHRE   |Short Term Average Power Threshold setting, Not used here, set it 0
 * |[31:16] |LTTHRE    |Long Term Power Threshold
 * |        |          |To check the background energy, also serve as the lower limit of long term power
 * |        |          |When the long term power value is lower than the threshold, it will be set to the threshold value for VAD decision.
 * @var VAD_T::CTL3
 * Offset: 0x1C  VAD Control Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DEVTHRE   |Deviation Threshold
 * |        |          |To check if the incoming signal is substantially bigger than its background
 * |        |          |This may work to exclude breath sound as it is slowly varying, but not other sounds (e.g., footsteps, hand claps) with sudden amplitude increase.
 * |        |          |Small: easy to trigger, good for far-field pick-up, but requiring quiet environment.
 * |        |          |Large: good for handheld applications, but requiring louder voice to trigger.
 * |[31:16] |HOT       |Hang Over time
 * |        |          |Hang Over time setting, means how many clocks (CLKSD) of the ACTIVE (VAD_STATUS0[31]) staying high when the calculation is no longer bigger than the threshold
 * @var VAD_T::STATUS0
 * Offset: 0x20  VAD Status Read-back Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |STP       |Short Term Signal Power (Read Only)
 * |        |          |This field shows the short term signal power value.
 * |[31]    |ACTIVE    |VAD Activation Flag (Read Only)
 * |        |          |When the voice active event occurs, this bit will be set to 1.
 * |        |          |0 = No effect.
 * |        |          |1 = Voice detected.
 * |        |          |Note: When wake-up from idle mode, user need to set CHENn DMIC_CTL[3:0] for DMIC path normal operation.
 * @var VAD_T::STATUS1
 * Offset: 0x24  VAD Status Read-back Register 1
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |DEV       |Deviation (Read Only)
 * |        |          |This field shows deviation of the Long Term Signal Power and Short Term Signal Power.
 * |[31:16] |LTP       |Long Term Signal Power (Read Only)
 * |        |          |This field shows the long term signal power value.
 */
    __IO uint32_t SINCCTL;               /*!< [0x0000] VAD SINC Filter Control Register                                 */
    __IO uint32_t BIQCTL0;               /*!< [0x0004] VAD Biquad Filter Control Register 0                             */
    __IO uint32_t BIQCTL1;               /*!< [0x0008] VAD Biquad Filter Control Register 1                             */
    __IO uint32_t BIQCTL2;               /*!< [0x000c] VAD Biquad Filter Control Register 2                             */
    __IO uint32_t CTL0;                  /*!< [0x0010] VAD Control Register 0                                           */
    __IO uint32_t CTL1;                  /*!< [0x0014] VAD Control Register 1                                           */
    __IO uint32_t CTL2;                  /*!< [0x0018] VAD Control Register 2                                           */
    __IO uint32_t CTL3;                  /*!< [0x001c] VAD Control Register 3                                           */
    __I  uint32_t STATUS0;               /*!< [0x0020] VAD Status Read-back Register 0                                  */
    __I  uint32_t STATUS1;               /*!< [0x0024] VAD Status Read-back Register 1                                  */
//	__IO uint32_t PDMEDCTL;              /*!< [0x0028] VAD PDMED Control Register                                       */
//  __IO uint32_t PDMEDSTATUS;           /*!< [0x002C] VAD PDMED Status Register                                        */

