wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/dmic_reg.h
//#define DMIC_DIV_HPFCUTF_Pos             (28)                                              /*!< DMIC_T::DIV: HPFCUTF Position          */
//#define DMIC_DIV_HPFCUTF_Msk             (0xful << DMIC_DIV_HPFCUTF_Pos)                   /*!< DMIC_T::DIV: HPFCUTF Mask              */

#define DMIC_STATUS_FULL_Pos             (0)                                               /*!< DMIC_T::STATUS: FULL Position          */
#define DMIC_STATUS_FULL_Msk             (0x1ul << DMIC_STATUS_FULL_Pos)                   /*!< DMIC_T::STATUS: FULL Mask              */

#define DMIC_STATUS_EMPTY_Pos            (1)                                               /*!< DMIC_T::STATUS: EMPTY Position         */
#define DMIC_STATUS_EMPTY_Msk            (0x1ul << DMIC_STATUS_EMPTY_Pos)                  /*!< DMIC_T::STATUS: EMPTY Mask             */

#define DMIC_STATUS_DMTHIF_Pos           (2)                                               /*!< DMIC_T::STATUS: DMTHIF Position        */
#define DMIC_STATUS_DMTHIF_Msk           (0x1ul << DMIC_STATUS_DMTHIF_Pos)                 /*!< DMIC_T::STATUS: DMTHIF Mask            */

#define DMIC_STATUS_FIFOPTR_Pos          (4)                                               /*!< DMIC_T::STATUS: FIFOPTR Position       */
#define DMIC_STATUS_FIFOPTR_Msk          (0x1ful << DMIC_STATUS_FIFOPTR_Pos)               /*!< DMIC_T::STATUS: FIFOPTR Mask           */

#define DMIC_STATUS_DSP0ROMBISTFAIL_Pos  (9)                                               /*!< DMIC_T::STATUS: DSP0ROMBISTFAIL Position*/
#define DMIC_STATUS_DSP0ROMBISTFAIL_Msk  (0x1ul << DMIC_STATUS_DSP0ROMBISTFAIL_Pos)        /*!< DMIC_T::STATUS: DSP0ROMBISTFAIL Mask   */

#define DMIC_STATUS_DSP1ROMBISTFAIL_Pos  (10)                                              /*!< DMIC_T::STATUS: DSP1ROMBISTFAIL Position*/
#define DMIC_STATUS_DSP1ROMBISTFAIL_Msk  (0x1ul << DMIC_STATUS_DSP1ROMBISTFAIL_Pos)        /*!< DMIC_T::STATUS: DSP1ROMBISTFAIL Mask   */

#define DMIC_STATUS_DSP0RAMBISTFAIL_Pos  (13)                                              /*!< DMIC_T::STATUS: DSP0RAMBISTFAIL Position*/
#define DMIC_STATUS_DSP0RAMBISTFAIL_Msk  (0x1ul << DMIC_STATUS_DSP0RAMBISTFAIL_Pos)        /*!< DMIC_T::STATUS: DSP0RAMBISTFAIL Mask   */

#define DMIC_STATUS_DSP1RAMBISTFAIL_Pos  (14)                                              /*!< DMIC_T::STATUS: DSP1RAMBISTFAIL Position*/
#define DMIC_STATUS_DSP1RAMBISTFAIL_Msk  (0x1ul << DMIC_STATUS_DSP1RAMBISTFAIL_Pos)        /*!< DMIC_T::STATUS: DSP1RAMBISTFAIL Mask   */

//#define DMIC_STATUS_FIFOBISTFAIL_Pos     (17)                                              /*!< DMIC_T::STATUS: FIFOBISTFAIL Position  */
//#define DMIC_STATUS_FIFOBISTFAIL_Msk     (0x1ul << DMIC_STATUS_FIFOBISTFAIL_Pos)           /*!< DMIC_T::STATUS: FIFOBISTFAIL Mask      */

#define DMIC_STATUS_DSP0ROMBISTFINISH_Pos (18)                                             /*!< DMIC_T::STATUS: DSP0ROMBISTFINISH Position*/
#define DMIC_STATUS_DSP0ROMBISTFINISH_Msk (0x1ul << DMIC_STATUS_DSP0ROMBISTFINISH_Pos)     /*!< DMIC_T::STATUS: DSP0ROMBISTFINISH Mask */

#define DMIC_STATUS_DSP1ROMBISTFINISH_Pos (19)                                             /*!< DMIC_T::STATUS: DSP1ROMBISTFINISH Position*/
#define DMIC_STATUS_DSP1ROMBISTFINISH_Msk (0x1ul << DMIC_STATUS_DSP1ROMBISTFINISH_Pos)     /*!< DMIC_T::STATUS: DSP1ROMBISTFINISH Mask */

#define DMIC_STATUS_DSP0RAMBISTFINISH_Pos (22)                                             /*!< DMIC_T::STATUS: DSP0RAMBISTFINISH Position*/
#define DMIC_STATUS_DSP0RAMBISTFINISH_Msk (0x1ul << DMIC_STATUS_DSP0RAMBISTFINISH_Pos)     /*!< DMIC_T::STATUS: DSP0RAMBISTFINISH Mask */

#define DMIC_STATUS_DSP1RAMBISTFINISH_Pos (23)                                             /*!< DMIC_T::STATUS: DSP1RAMBISTFINISH Position*/
#define DMIC_STATUS_DSP1RAMBISTFINISH_Msk (0x1ul << DMIC_STATUS_DSP1RAMBISTFINISH_Pos)     /*!< DMIC_T::STATUS: DSP1RAMBISTFINISH Mask */

//#define DMIC_STATUS_FIFOBISTFINISH_Pos   (26)                                              /*!< DMIC_T::STATUS: FIFOBISTFINISH Position*/
//#define DMIC_STATUS_FIFOBISTFINISH_Msk   (0x1ul << DMIC_STATUS_FIFOBISTFINISH_Pos)         /*!< DMIC_T::STATUS: FIFOBISTFINISH Mask    */

#define DMIC_STATUS_DSPBISTEN_Pos        (30)                                              /*!< DMIC_T::STATUS: DSPBISTEN Position     */
#define DMIC_STATUS_DSPBISTEN_Msk        (0x1ul << DMIC_STATUS_DSPBISTEN_Pos)              /*!< DMIC_T::STATUS: DSPBISTEN Mask         */

//#define DMIC_STATUS_FIFOBISTEN_Pos       (31)                                              /*!< DMIC_T::STATUS: FIFOBISTEN Position    */
//#define DMIC_STATUS_FIFOBISTEN_Msk       (0x1ul << DMIC_STATUS_FIFOBISTEN_Pos)             /*!< DMIC_T::STATUS: FIFOBISTEN Mask        */

#define DMIC_PDMACTL_PDMAEN_Pos          (0)                                               /*!< DMIC_T::PDMACTL: PDMAEN Position       */
#define DMIC_PDMACTL_PDMAEN_Msk          (0x1ul << DMIC_PDMACTL_PDMAEN_Pos)                /*!< DMIC_T::PDMACTL: PDMAEN Mask           */

#define DMIC_PDMACTL_LPPDMAEN_Pos          (0)                                               /*!< DMIC_T::PDMACTL: PDMAEN Position       */
#define DMIC_PDMACTL_LPPDMAEN_Msk          (0x1ul << DMIC_PDMACTL_LPPDMAEN_Pos)                /*!< DMIC_T::PDMACTL: PDMAEN Mask           */

#define DMIC_LPPDMACTL_LPPDMAEN_Pos          (0)                                               /*!< DMIC_T::PDMACTL: PDMAEN Position       */
#define DMIC_LPPDMACTL_LPPDMAEN_Msk          (0x1ul << DMIC_LPPDMACTL_LPPDMAEN_Pos)                /*!< DMIC_T::PDMACTL: PDMAEN Mask           */

#define DMIC_FIFO_FIFO_Pos               (0)                                               /*!< DMIC_T::FIFO: FIFO Position            */
#define DMIC_FIFO_FIFO_Msk               (0xfffffful << DMIC_FIFO_FIFO_Pos)              /*!< DMIC_T::FIFO: FIFO Mask                */

#define DMIC_GAINCTL0_CHyyLVOL_Pos        (0)                                               /*!< DMIC_T::GAINCTL0: CHyyLVOL Position     */
#define DMIC_GAINCTL0_CHyyLVOL_Msk        (0xfffful << DMIC_GAINCTL0_CHyyLVOL_Pos)           /*!< DMIC_T::GAINCTL0: CHyyLVOL Mask         */

#define DMIC_GAINCTL0_CHxxRVOL_Pos        (16)                                              /*!< DMIC_T::GAINCTL0: CHxxRVOL Position     */
#define DMIC_GAINCTL0_CHxxRVOL_Msk        (0xfffful << DMIC_GAINCTL0_CHxxRVOL_Pos)           /*!< DMIC_T::GAINCTL0: CHxxRVOL Mask         */

#define DMIC_GAINCTL1_CHyyLVOL_Pos        (0)                                               /*!< DMIC_T::GAINCTL1: CHyyLVOL Position     */
#define DMIC_GAINCTL1_CHyyLVOL_Msk        (0xfffful << DMIC_GAINCTL1_CHyyLVOL_Pos)           /*!< DMIC_T::GAINCTL1: CHyyLVOL Mask         */

