wosayttn/M55M1BSP/Library/Device/Nuvoton/TC8263/Include/dmic_reg.h
#define DMIC_GAINCTL1_CHxxRVOL_Pos        (16)                                              /*!< DMIC_T::GAINCTL1: CHxxRVOL Position     */
#define DMIC_GAINCTL1_CHxxRVOL_Msk        (0xfffful << DMIC_GAINCTL1_CHxxRVOL_Pos)           /*!< DMIC_T::GAINCTL1: CHxxRVOL Mask         */

#define DMIC_ZEROSAMPLETHD_ZEROCROSSTH_Pos (0)                                               /*!< DMIC_T::ZEROSAMPLETHD: ZEROCROSSTH Position     */
#define DMIC_ZEROSAMPLETHD_ZEROCROSSTH_Msk (0xfffffful << DMIC_ZEROSAMPLETHD_ZEROCROSSTH_Pos)      /*!< DMIC_T::ZEROSAMPLETHD: ZEROCROSSTH Mask         */

#define DMIC_DLYCTL_DSP0CLKTYP_Pos      (0)                                               /*!< DMIC_T::DLYCTL: DSP0CLKTYP Position   */
#define DMIC_DLYCTL_DSP0CLKTYP_Msk      (0x1ul << DMIC_DLYCTL_DSP0CLKTYP_Pos)     /*!< DMIC_T::DLYCTL: DSP0CLKTYP Mask       */

#define DMIC_DLYCTL_DSP1CLKTYP_Pos      (1)                                               /*!< DMIC_T::DLYCTL: DSP1CLKTYP Position   */
#define DMIC_DLYCTL_DSP1CLKTYP_Msk      (0x1ul << DMIC_DLYCTL_DSP1CLKTYP_Pos)     /*!< DMIC_T::DLYCTL: DSP1CLKTYP Mask       */

#define DMIC_DLYCTL_DSP0DLY_Pos      (8)                                               /*!< DMIC_T::DLYCTL: DSP0DLY Position   */
#define DMIC_DLYCTL_DSP0DLY_Msk      (0x7ul << DMIC_DLYCTL_DSP0DLY_Pos)     /*!< DMIC_T::DLYCTL: DSP0DLY Mask       */

#define DMIC_DLYCTL_DSP1DLY_Pos      (12)                                               /*!< DMIC_T::DLYCTL: DSP1DLY Position   */
#define DMIC_DLYCTL_DSP1DLY_Msk      (0x7ul << DMIC_DLYCTL_DSP1DLY_Pos)     /*!< DMIC_T::DLYCTL: DSP1DLY Mask       */

#define DMIC_RAMDATA_DSPRAMDATA_Pos      (0)                                               /*!< DMIC_T::RAMDATA: DSPRAMDATA Position   */
#define DMIC_RAMDATA_DSPRAMDATA_Msk      (0xfffffffful << DMIC_RAMDATA_DSPRAMDATA_Pos)     /*!< DMIC_T::RAMDATA: DSPRAMDATA Mask       */

#define DMIC_ROMDATA_DSPROMDATA_Pos      (0)                                               /*!< DMIC_T::ROMDATA: DSPROMDATA Position   */
#define DMIC_ROMDATA_DSPROMDATA_Msk      (0xfffffffful << DMIC_ROMDATA_DSPROMDATA_Pos)     /*!< DMIC_T::ROMDATA: DSPROMDATA Mask       */

#define DMIC_ROMMBISTL_DSPROMMBISTSIGL_Pos (0)                                             /*!< DMIC_T::ROMMBISTL: DSPROMMBISTSIGL Position*/
#define DMIC_ROMMBISTL_DSPROMMBISTSIGL_Msk (0xfffffffful << DMIC_ROMMBISTL_DSPROMMBISTSIGL_Pos) /*!< DMIC_T::ROMMBISTL: DSPROMMBISTSIGL Mask*/

#define DMIC_ROMMBISTH_DSPROMMBISTSIGH_Pos (0)                                             /*!< DMIC_T::ROMMBISTH: DSPROMMBISTSIGH Position*/
#define DMIC_ROMMBISTH_DSPROMMBISTSIGH_Msk (0xfffffffful << DMIC_ROMMBISTH_DSPROMMBISTSIGH_Pos) /*!< DMIC_T::ROMMBISTH: DSPROMMBISTSIGH Mask*/

#define VAD_SINCCTL_SINCOSR_Pos          (8)                                               /*!< VAD_T::SINCCTL: SINCOSR Position       */
#define VAD_SINCCTL_SINCOSR_Msk          (0xful << VAD_SINCCTL_SINCOSR_Pos)                /*!< VAD_T::SINCCTL: SINCOSR Mask           */

#define VAD_SINCCTL_SINCGAIN_Pos         (12)                                              /*!< VAD_T::SINCCTL: SINCGAIN Position      */
#define VAD_SINCCTL_SINCGAIN_Msk         (0xful << VAD_SINCCTL_SINCGAIN_Pos)               /*!< VAD_T::SINCCTL: SINCGAIN Mask          */

#define VAD_SINCCTL_VADMCLKDIV_Pos       (16)                                              /*!< VAD_T::SINCCTL: VADMCLKDIV Position      */
#define VAD_SINCCTL_VADMCLKDIV_Msk       (0xfful << VAD_SINCCTL_VADMCLKDIV_Pos)               /*!< VAD_T::SINCCTL: VADMCLKDIV Mask          */

#define VAD_SINCCTL_DATAOFF_Pos          (28)                                              /*!< VAD_T::SINCCTL: DATAOFF Position       */
#define VAD_SINCCTL_DATAOFF_Msk          (0x1ul << VAD_SINCCTL_DATAOFF_Pos)                /*!< VAD_T::SINCCTL: DATAOFF Mask           */

#define VAD_SINCCTL_SW_Pos               (29)                                              /*!< VAD_T::SINCCTL: SW Position            */
#define VAD_SINCCTL_SW_Msk               (0x1ul << VAD_SINCCTL_SW_Pos)                     /*!< VAD_T::SINCCTL: SW Mask                */

#define VAD_SINCCTL_ACTCL_Pos            (30)                                              /*!< VAD_T::SINCCTL: ACTCL Position         */
#define VAD_SINCCTL_ACTCL_Msk            (0x1ul << VAD_SINCCTL_ACTCL_Pos)                  /*!< VAD_T::SINCCTL: ACTCL Mask             */

#define VAD_SINCCTL_VADEN_Pos            (31)                                              /*!< VAD_T::SINCCTL: VADEN Position         */
#define VAD_SINCCTL_VADEN_Msk            (0x1ul << VAD_SINCCTL_VADEN_Pos)                  /*!< VAD_T::SINCCTL: VADEN Mask             */

#define VAD_BIQCTL0_BIQA1_Pos            (0)                                               /*!< VAD_T::BIQCTL0: BIQA1 Position         */
#define VAD_BIQCTL0_BIQA1_Msk            (0xfffful << VAD_BIQCTL0_BIQA1_Pos)               /*!< VAD_T::BIQCTL0: BIQA1 Mask             */

#define VAD_BIQCTL0_BIQA2_Pos            (16)                                              /*!< VAD_T::BIQCTL0: BIQA2 Position         */
#define VAD_BIQCTL0_BIQA2_Msk            (0xfffful << VAD_BIQCTL0_BIQA2_Pos)               /*!< VAD_T::BIQCTL0: BIQA2 Mask             */

#define VAD_BIQCTL1_BIQB0_Pos            (0)                                               /*!< VAD_T::BIQCTL1: BIQB0 Position         */
#define VAD_BIQCTL1_BIQB0_Msk            (0xfffful << VAD_BIQCTL1_BIQB0_Pos)               /*!< VAD_T::BIQCTL1: BIQB0 Mask             */

#define VAD_BIQCTL1_BIQB1_Pos            (16)                                              /*!< VAD_T::BIQCTL1: BIQB1 Position         */
#define VAD_BIQCTL1_BIQB1_Msk            (0xfffful << VAD_BIQCTL1_BIQB1_Pos)               /*!< VAD_T::BIQCTL1: BIQB1 Mask             */

#define VAD_BIQCTL2_BIQB2_Pos            (0)                                               /*!< VAD_T::BIQCTL2: BIQB2 Position         */
#define VAD_BIQCTL2_BIQB2_Msk            (0xfffful << VAD_BIQCTL2_BIQB2_Pos)               /*!< VAD_T::BIQCTL2: BIQB2 Mask             */

#define VAD_BIQCTL2_BIQEN_Pos            (31)                                              /*!< VAD_T::BIQCTL2: BIQEN Position         */
#define VAD_BIQCTL2_BIQEN_Msk            (0x1ul << VAD_BIQCTL2_BIQEN_Pos)                  /*!< VAD_T::BIQCTL2: BIQEN Mask             */

#define VAD_CTL0_STAT_Pos                (0)                                               /*!< VAD_T::CTL0: STAT Position             */
#define VAD_CTL0_STAT_Msk                (0xfful << VAD_CTL0_STAT_Pos)                     /*!< VAD_T::CTL0: STAT Mask                 */

